{
  "tests": [
    [
      {
        "id": 0,
        "name": "Distance",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.4308567220000001,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 1,
        "name": "Distance Complex",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.155336642,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 2,
        "name": "Suggestion",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.239187131,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 3,
        "name": "Suggestion Complex",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.286791497,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 4,
        "name": "Common",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.351121388,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 5,
        "name": "Common Complex",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.193659581,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 6,
        "name": "Popular",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.374375243,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 7,
        "name": "Popular Complex",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.39755709,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 8,
        "name": "Friends Complex 1",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.1540689419999999,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 9,
        "name": "Friends Complex 2",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 1.179687713,
        "timeout": 30000,
        "test_score": 3
      }
    ],
    [
      {
        "id": 0,
        "name": "Post/Repost",
        "status": "3",
        "log": "Created \"@realDonaldTrump Did you really start mewing to skibidi ohio? Are you a sigma or did you get fandum taxxed\" for Emil\nCreated \"Pamantul este plat!\" for Octav\nCreated \"STEAUA27\" for Daiana\nCreated \"Ai incercat cu otel galvanizat?\" for Tiberiu\nCreated \"Sper sa iau licenta anul asta\" for Caius\nCreated repost #6 for Voicu\nCreated repost #7 for Lica\nCreated repost #8 for Viorica\nCreated repost #9 for Claudia\nCreated repost #10 for Silvana\nCreated repost #11 for Amza\nCreated repost #12 for Ludovica\nCreated repost #13 for Codrut\nCreated repost #14 for Artemisa\nCreated repost #15 for Mirabela\n\"@realDonaldTrump Did you really start mewing to skibidi ohio? Are you a sigma or did you get fandum taxxed\" - Post by Emil\nRepost #9 by Claudia\nRepost #13 by Codrut\n\"Pamantul este plat!\" - Post by Octav\nRepost #10 by Silvana\nRepost #11 by Amza\nRepost #15 by Mirabela\n\"STEAUA27\" - Post by Daiana\nRepost #8 by Viorica\n\"Ai incercat cu otel galvanizat?\" - Post by Tiberiu\nRepost #7 by Lica\n\"Sper sa iau licenta anul asta\" - Post by Caius\nRepost #6 by Voicu\nRepost #12 by Ludovica\nRepost #14 by Artemisa\n",
        "time_normal": 0.001115795,
        "time_valgrind": 1.2682137660000001,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 1,
        "name": "Post/Repost Complex",
        "status": "3",
        "log": "Created \"Ai incercat cu otel galvanizat?\" for Ilinca\nCreated \"O luam de la cap din nou Stii ca sunt dilau-lau-lau Am la mine banii pe show Vagabontii-n dreapta, go go go O sa fie lata Suntem in brigada Atmosfera e ciudata Cand bei apa plata\" for Veniamin\nCreated \"onika when the burgers are in plate\" for Daniel\nCreated \"I'm built different. Incorrectly.\" for Lucretiu\nCreated \"marriage is just preordering a milf\" for Lorin\nCreated \"Exploding kittens\" for Venera\nCreated \"Ce e aia Galgoaie?\" for Narcis\nCreated \"onika when the burgers are in plate\" for Ina\nCreated \"*touches circumcision scar* who did this to you\" for Felix\nCreated \"@realDonaldTrump Did you really start mewing to skibidi ohio? Are you a sigma or did you get fandum taxxed\" for Letitia\nCreated repost #11 for Maricica\nCreated repost #12 for Natalia\nCreated repost #13 for Cristobal\nCreated repost #14 for Fiodor\nCreated repost #15 for Cerasela\nCreated repost #16 for Banel\nCreated repost #17 for Nidia\nCreated repost #18 for Nicoara\nCreated repost #19 for Floarea\nCreated repost #20 for Eftimie\nCreated repost #21 for Pamfil\nCreated repost #22 for Marioara\nCreated repost #23 for Sava\nCreated repost #24 for Luca\nCreated repost #25 for Ilie\nCreated repost #26 for Octaviana\nCreated repost #27 for Romanita\nCreated repost #28 for Adelina\nCreated repost #29 for Geanina\nCreated repost #30 for Luca\nRepost #21 by Pamfil\nRepost #15 by Cerasela\nRepost #20 by Eftimie\nRepost #30 by Luca\n\"O luam de la cap din nou Stii ca sunt dilau-lau-lau Am la mine banii pe show Vagabontii-n dreapta, go go go O sa fie lata Suntem in brigada Atmosfera e ciudata Cand bei apa plata\" - Post by Veniamin\nRepost #17 by Nidia\nRepost #24 by Luca\n\"I'm built different. Incorrectly.\" - Post by Lucretiu\nRepost #13 by Cristobal\nRepost #14 by Fiodor\nRepost #19 by Floarea\nRepost #22 by Marioara\n\"Ce e aia Galgoaie?\" - Post by Narcis\n\"onika when the burgers are in plate\" - Post by Ina\nRepost #12 by Natalia\nRepost #18 by Nicoara\nRepost #27 by Romanita\n\"*touches circumcision scar* who did this to you\" - Post by Felix\nRepost #20 by Eftimie\nRepost #26 by Octaviana\nRepost #29 by Geanina\n",
        "time_normal": 0.000773848,
        "time_valgrind": 1.19913679,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 2,
        "name": "LCA",
        "status": "3",
        "log": "Created \"Batman can’t even compare to Ryan Gosling\" for Emanoil\nCreated \"Cine sapa groapa altuia departe ajunge\" for Alberta\nCreated \"vreau sa merg la mare si sa stau la soare, dar n-am cu cine si n-am cu ceee, ma am doar pe mine, ia priviti mai bine, hai ca nu-s de coalea breee\" for Luana\nCreated \"Tara arde si baba zice ca sunt acri\" for Dorina\nCreated \"Exploding kittens\" for Laurentiu\nCreated repost #6 for Pamfil\nCreated repost #7 for Laurentiu\nCreated repost #8 for Livia\nCreated repost #9 for Alice\nCreated repost #10 for Norica\nCreated repost #11 for Paula\nCreated repost #12 for Carol\nCreated repost #13 for Didina\nCreated repost #14 for Gregorian\nCreated repost #15 for Didina\nCreated repost #16 for Constanta\nCreated repost #17 for Steluta\nCreated repost #18 for Tudor\nCreated repost #19 for Ionut\nCreated repost #20 for Crina\nCreated repost #21 for Cristea\nCreated repost #22 for Ica\nCreated repost #23 for Antonie\nCreated repost #24 for Aurelian\nCreated repost #25 for Oana\nThe first common repost of 13 and 14 is 5\nThe first common repost of 24 and 6 is 6\nThe first common repost of 20 and 9 is 9\nThe first common repost of 6 and 24 is 6\nThe first common repost of 16 and 7 is 7\nThe first common repost of 23 and 25 is 21\nThe first common repost of 17 and 19 is 2\nThe first common repost of 15 and 22 is 15\n",
        "time_normal": 0.0,
        "time_valgrind": 0.968920834,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 3,
        "name": "LCA Complex",
        "status": "3",
        "log": "Created \"N ai restanta,n ai prestanta verik!\" for Anamaria\nCreated \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" for Alis\nCreated \"head so good she honor roll she riding me like carnival\" for Clarisa\nCreated \"did you know that theres a tunnel under ocean boulevard\" for Theodor\nCreated \"head so good she honor roll she riding me like carnival\" for Carina\nCreated \"Citeste asta fara sa vada si ceilalti si prefa-te ca e amuzant si te distrezi copios\" for Raducu\nCreated \"stream girls night by loossemble\" for Georgiana\nCreated \"did you know that theres a tunnel under ocean boulevard\" for Anghelina\nCreated \"N ai restanta,n ai prestanta verik!\" for Adelaida\nCreated \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\" for Vasile\nCreated repost #11 for Laurentiu\nCreated repost #12 for Dan\nCreated repost #13 for Traian\nCreated repost #14 for Petronela\nCreated repost #15 for Ana\nCreated repost #16 for Rafael\nCreated repost #17 for Sever\nCreated repost #18 for Veta\nCreated repost #19 for Mariuca\nCreated repost #20 for Dominic\nCreated repost #21 for Beatrice\nCreated repost #22 for Daciana\nCreated repost #23 for Gratian\nCreated repost #24 for Augustina\nCreated repost #25 for Irina\nCreated repost #26 for Marilena\nCreated repost #27 for Emanuil\nCreated repost #28 for Blanduzia\nCreated repost #29 for Matei\nCreated repost #30 for Fiodor\nCreated repost #31 for Basarab\nCreated repost #32 for Roxana\nCreated repost #33 for Sidonia\nCreated repost #34 for Rodica\nCreated repost #35 for Brandusa\nCreated repost #36 for Fabian\nCreated repost #37 for Cazimir\nCreated repost #38 for Georgeta\nCreated repost #39 for Petrut\nCreated repost #40 for Mioara\nCreated repost #41 for Heracleea\nCreated repost #42 for Teohari\nCreated repost #43 for Felix\nCreated repost #44 for Dafina\nCreated repost #45 for Daniel\nCreated repost #46 for Sidonia\nCreated repost #47 for Corina\nCreated repost #48 for Vicentiu\nCreated repost #49 for Ludovica\nCreated repost #50 for Cerasela\nThe first common repost of 22 and 49 is 22\nThe first common repost of 28 and 29 is 6\nThe first common repost of 46 and 25 is 25\nThe first common repost of 27 and 47 is 27\nThe first common repost of 14 and 20 is 6\nThe first common repost of 35 and 11 is 4\nThe first common repost of 22 and 49 is 22\nThe first common repost of 38 and 34 is 34\nThe first common repost of 33 and 45 is 33\nThe first common repost of 37 and 39 is 33\n",
        "time_normal": 0.0,
        "time_valgrind": 1.036236396,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 4,
        "name": "Like",
        "status": "3",
        "log": "Created \"https://www.youtube.com/watch?v=wtQGvuuzst0\" for Beatrice\nCreated \"The horros persist but so do I\" for Venera\nCreated \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\" for Cristobal\nCreated \"Congratulations to the Astronauts that left Earth today. Good choice\" for Daciana\nCreated \"she=onika ate=burgers\" for Henrieta\nCreated repost #6 for Timea\nCreated repost #7 for Iacob\nCreated repost #8 for Magdalena\nCreated repost #9 for Ivona\nCreated repost #10 for Ruxandra\nUser Bartolomeu liked post \"The horros persist but so do I\"\nUser Iosif liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Dumitra liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Olimpia liked repost \"Congratulations to the Astronauts that left Earth today. Good choice\"\nUser Niculina liked post \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Panagachie liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Casiana liked post \"The horros persist but so do I\"\nUser Casian liked post \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Casiana liked repost \"she=onika ate=burgers\"\nUser Casiana unliked post \"The horros persist but so do I\"\nUser Veniamin liked post \"The horros persist but so do I\"\nUser Niculina unliked post \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nPost \"https://www.youtube.com/watch?v=wtQGvuuzst0\" has 2 likes\nPost \"The horros persist but so do I\" has 2 likes\nPost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\" has 1 likes\nPost \"Congratulations to the Astronauts that left Earth today. Good choice\" has 0 likes\nPost \"she=onika ate=burgers\" has 0 likes\n",
        "time_normal": 0.0,
        "time_valgrind": 1.33887601,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 5,
        "name": "Like Complex",
        "status": "3",
        "log": "Created \"Mergem inainte ca inainte era mai bine\" for Paulina\nCreated \"stream girls night by loossemble\" for Tudor\nCreated \"Going to Apollo who s down?\" for Haralambie\nCreated \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\" for Iris\nCreated \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\" for Iridenta\nCreated \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\" for Antonie\nCreated \"Luke, eu am plecat dupa lapte acum 20 de ani\" for Zoe\nCreated \"https://www.youtube.com/watch?v=wtQGvuuzst0\" for Banel\nCreated \"onika when the burgers are in plate\" for Lucia\nCreated \"Despite the constant negative press covfefe\" for Betina\nCreated repost #11 for Renata\nCreated repost #12 for Mihnea\nCreated repost #13 for Eliza\nCreated repost #14 for Gabriel\nCreated repost #15 for Ghita\nCreated repost #16 for Anastasia\nCreated repost #17 for Sever\nCreated repost #18 for Gabriel\nCreated repost #19 for Teohari\nCreated repost #20 for Eduard\nUser Draga liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Clarisa liked post \"Luke, eu am plecat dupa lapte acum 20 de ani\"\nUser Ciprian liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Nicusor liked post \"stream girls night by loossemble\"\nUser Betina liked repost \"Luke, eu am plecat dupa lapte acum 20 de ani\"\nUser Liana liked post \"Luke, eu am plecat dupa lapte acum 20 de ani\"\nUser Vasilica liked post \"Mergem inainte ca inainte era mai bine\"\nUser Mioara liked post \"Mergem inainte ca inainte era mai bine\"\nUser Liviu liked post \"Despite the constant negative press covfefe\"\nUser Zoe liked post \"stream girls night by loossemble\"\nUser Aura liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Ciprian unliked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Mioara unliked post \"Mergem inainte ca inainte era mai bine\"\nUser Paul liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Zoe liked repost \"Despite the constant negative press covfefe\"\nUser Aura liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Anamaria liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Constantina liked post \"Despite the constant negative press covfefe\"\nUser Viorela liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Marius liked repost \"stream girls night by loossemble\"\nUser Zamfira liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Lica liked post \"Mergem inainte ca inainte era mai bine\"\nUser Gica liked post \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\"\nUser Nicodim liked repost \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\"\nUser Aura unliked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Lorin liked post \"stream girls night by loossemble\"\nUser Plesu liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Cristina liked post \"Going to Apollo who s down?\"\nUser Leontin liked post \"Despite the constant negative press covfefe\"\nUser Rafila liked post \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\"\nUser Maxim liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Miron liked post \"Despite the constant negative press covfefe\"\nUser Aura liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Zoe unliked repost \"Despite the constant negative press covfefe\"\nUser Ada liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Ieremia liked post \"Luke, eu am plecat dupa lapte acum 20 de ani\"\nUser Draga liked repost \"onika when the burgers are in plate\"\nUser Agripina liked post \"onika when the burgers are in plate\"\nUser Razvan liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Nelu liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Costache liked repost \"Despite the constant negative press covfefe\"\nUser Geta liked post \"Going to Apollo who s down?\"\nUser Letitia liked repost \"stream girls night by loossemble\"\nUser Olimpiu liked repost \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\"\nUser Rafila liked repost \"onika when the burgers are in plate\"\nUser Razvan unliked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nRepost #20 has 0 likes\nRepost #16 has 0 likes\nRepost #12 has 1 likes\nRepost #15 has 0 likes\nRepost #14 has 1 likes\nPost \"Despite the constant negative press covfefe\" has 4 likes\nPost \"stream girls night by loossemble\" has 3 likes\nPost \"Going to Apollo who s down?\" has 2 likes\nPost \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\" has 5 likes\n",
        "time_normal": 0.0,
        "time_valgrind": 1.186540456,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 6,
        "name": "Ratio",
        "status": "3",
        "log": "Created \"she=onika ate=burgers\" for Mihail\nCreated \"Trebuia sa cumpar Bitcoin acum 10 ani in loc sa ma loc de-a prinselea.\" for Miruna\nCreated \"Cine a pus wc-ul in baie a fost un geniu\" for Panait\nCreated \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\" for Stana\nCreated \"down on the west coast they got a saying if youre not drinking then youre not playing\" for Antonie\nCreated repost #6 for Barbu\nCreated repost #7 for Ivan\nCreated repost #8 for Antonela\nCreated repost #9 for Agnos\nCreated repost #10 for Andra\nUser Axenia liked post \"she=onika ate=burgers\"\nUser Draga liked repost \"she=onika ate=burgers\"\nUser Lascar liked repost \"Trebuia sa cumpar Bitcoin acum 10 ani in loc sa ma loc de-a prinselea.\"\nUser Ilinca liked post \"down on the west coast they got a saying if youre not drinking then youre not playing\"\nUser Codrut liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Axenia liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Ieremia liked repost \"Trebuia sa cumpar Bitcoin acum 10 ani in loc sa ma loc de-a prinselea.\"\nUser Cedrin liked post \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Iacob liked post \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Milena liked post \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Haralambie liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Cezar liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Emil liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Milena liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Angel liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Anghel liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Georgel liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Tiberiu liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Dana liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Veta liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Zeno liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Sabrina liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Sabin liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Iurie liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Salomea liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Florea liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Zaraza liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Theodor liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Doru liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Pamfil liked repost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nPost \"she=onika ate=burgers\" has 1 likes\nPost \"Trebuia sa cumpar Bitcoin acum 10 ani in loc sa ma loc de-a prinselea.\" has 0 likes\nPost \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\" has 3 likes\nPost \"down on the west coast they got a saying if youre not drinking then youre not playing\" has 1 likes\nThe original post is the highest rated\nPost 4 got ratio'd by repost 7\nThe original post is the highest rated\n",
        "time_normal": 0.0,
        "time_valgrind": 1.123422182,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 7,
        "name": "Ratio Complex",
        "status": "3",
        "log": "Created \"erm what the sigma\" for Pavel\nCreated \"https://www.youtube.com/watch?v=wtQGvuuzst0\" for Milena\nCreated \"https://www.youtube.com/watch?v=wtQGvuuzst0\" for Anghel\nCreated \"La placinte la razboi, inainte inapoi\" for Beatrice\nCreated \"N ai restanta,n ai prestanta verik!\" for Pavel\nCreated \"In o lume plina de mizerie, fii tu mop!\" for Visarion\nCreated \"You’re not like us\" for Augustina\nCreated \"fantastic!\" for Gica\nCreated \"Adrian Elicopter vs Selly. Who wins?\" for Lili\nCreated \"Segmentation fault(core dumped)\" for Marinela\nCreated repost #11 for Leana\nCreated repost #12 for Magdalena\nCreated repost #13 for Florin\nCreated repost #14 for Larisa\nCreated repost #15 for Filofteia\nCreated repost #16 for Malina\nCreated repost #17 for Erica\nCreated repost #18 for Ludovic\nCreated repost #19 for Sidonia\nCreated repost #20 for Viorela\nUser Olivia liked post \"You’re not like us\"\nUser Erica liked post \"Adrian Elicopter vs Selly. Who wins?\"\nUser Olimpia liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Tudor liked post \"fantastic!\"\nUser Eliza liked post \"Adrian Elicopter vs Selly. Who wins?\"\nUser Eric liked post \"Segmentation fault(core dumped)\"\nUser Stefania liked post \"In o lume plina de mizerie, fii tu mop!\"\nUser Amelia liked post \"Segmentation fault(core dumped)\"\nUser Andrian liked post \"In o lume plina de mizerie, fii tu mop!\"\nUser Dimitrina liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Anamaria liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Arina liked post \"fantastic!\"\nUser Mihnea liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Amza liked post \"fantastic!\"\nUser Rica liked repost \"erm what the sigma\"\nUser Olga liked repost \"La placinte la razboi, inainte inapoi\"\nUser Mihail liked post \"You’re not like us\"\nUser Dida liked post \"La placinte la razboi, inainte inapoi\"\nUser Malina liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Dafina liked post \"La placinte la razboi, inainte inapoi\"\nUser Daniel liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Lazar liked post \"Segmentation fault(core dumped)\"\nUser Didina liked post \"N ai restanta,n ai prestanta verik!\"\nUser Razvan liked post \"Segmentation fault(core dumped)\"\nUser Axenia liked post \"N ai restanta,n ai prestanta verik!\"\nUser Mina liked post \"You’re not like us\"\nUser Augustin liked repost \"You’re not like us\"\nUser Vlad liked post \"Adrian Elicopter vs Selly. Who wins?\"\nUser Mirabela liked post \"La placinte la razboi, inainte inapoi\"\nUser Iosif liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Anatolie liked post \"In o lume plina de mizerie, fii tu mop!\"\nUser Crenguta liked post \"fantastic!\"\nUser Stancu liked repost \"erm what the sigma\"\nUser Venera liked post \"fantastic!\"\nUser Viorel liked repost \"N ai restanta,n ai prestanta verik!\"\nUser Luana liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Codruta liked post \"You’re not like us\"\nUser Alex liked repost \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Gentiana liked post \"Segmentation fault(core dumped)\"\nUser Victoria liked repost \"In o lume plina de mizerie, fii tu mop!\"\nUser Mirabela liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Adelina liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Jean liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Robertina liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Letitia liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Iosif unliked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Maximilian liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Coralia liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Adina liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Horatiu liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Gratiela liked repost \"La placinte la razboi, inainte inapoi\"\nUser Dochia liked repost \"La placinte la razboi, inainte inapoi\"\nUser Caius liked repost \"La placinte la razboi, inainte inapoi\"\nUser Maximilian liked repost \"La placinte la razboi, inainte inapoi\"\nUser Flavia liked repost \"La placinte la razboi, inainte inapoi\"\nUser Laurentiu liked repost \"La placinte la razboi, inainte inapoi\"\nUser Paulina liked repost \"La placinte la razboi, inainte inapoi\"\nUser Renata liked repost \"La placinte la razboi, inainte inapoi\"\nUser Agnos liked repost \"La placinte la razboi, inainte inapoi\"\nUser Victoria liked repost \"La placinte la razboi, inainte inapoi\"\nUser Nicodim liked repost \"La placinte la razboi, inainte inapoi\"\nUser Iustin liked repost \"La placinte la razboi, inainte inapoi\"\nUser Daiana liked repost \"La placinte la razboi, inainte inapoi\"\nUser Dariana liked repost \"La placinte la razboi, inainte inapoi\"\nUser Carolina liked repost \"La placinte la razboi, inainte inapoi\"\nUser Miron liked repost \"La placinte la razboi, inainte inapoi\"\nUser Mitica liked repost \"La placinte la razboi, inainte inapoi\"\nUser Iurie liked repost \"La placinte la razboi, inainte inapoi\"\nUser Corvin liked repost \"La placinte la razboi, inainte inapoi\"\nUser Tudosia liked repost \"La placinte la razboi, inainte inapoi\"\nUser Casandra liked repost \"La placinte la razboi, inainte inapoi\"\nUser Lucretia liked repost \"La placinte la razboi, inainte inapoi\"\nUser Antoaneta liked repost \"La placinte la razboi, inainte inapoi\"\nUser Dorli liked repost \"La placinte la razboi, inainte inapoi\"\nUser Marta liked repost \"La placinte la razboi, inainte inapoi\"\nUser Eftimie liked repost \"La placinte la razboi, inainte inapoi\"\nUser Nechifor liked repost \"La placinte la razboi, inainte inapoi\"\nUser Evanghelina liked repost \"La placinte la razboi, inainte inapoi\"\nUser Lelia liked repost \"La placinte la razboi, inainte inapoi\"\nUser Ina liked repost \"La placinte la razboi, inainte inapoi\"\nRepost #16 has 0 likes\nRepost #17 has 0 likes\nRepost #13 has 1 likes\nPost \"fantastic!\" has 5 likes\nPost \"Adrian Elicopter vs Selly. Who wins?\" has 3 likes\nPost \"https://www.youtube.com/watch?v=wtQGvuuzst0\" has 4 likes\nPost \"In o lume plina de mizerie, fii tu mop!\" has 3 likes\nThe original post is the highest rated\nPost 4 got ratio'd by repost 20\nPost 1 got ratio'd by repost 14\nThe original post is the highest rated\nThe original post is the highest rated\n",
        "time_normal": 0.0,
        "time_valgrind": 0.675924707,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 8,
        "name": "Posts Complex 1",
        "status": "3",
        "log": "Created \"Pamantul este plat!\" for Octav\nCreated \"STEAUA27\" for Daiana\nCreated \"Ai incercat cu otel galvanizat?\" for Tiberiu\nCreated \"Sper sa iau licenta anul asta\" for Caius\nCreated \"Mai bine 5cm in fata decat 15 din spate\" for Voicu\nCreated repost #6 for Lica\nCreated repost #7 for Viorica\nCreated repost #8 for Claudia\nCreated repost #9 for Silvana\nCreated repost #10 for Amza\nUser Ludovica liked post \"Mai bine 5cm in fata decat 15 din spate\"\nUser Codrut liked post \"Pamantul este plat!\"\nUser Artemisa liked post \"Mai bine 5cm in fata decat 15 din spate\"\nUser Mirabela liked post \"STEAUA27\"\nUser Iosefina liked post \"Ai incercat cu otel galvanizat?\"\nUser Augustina liked post \"Sper sa iau licenta anul asta\"\nUser Mihnea liked post \"Pamantul este plat!\"\nUser Ilinca liked post \"Mai bine 5cm in fata decat 15 din spate\"\nUser Darius liked post \"Sper sa iau licenta anul asta\"\nUser Stelian liked post \"Mai bine 5cm in fata decat 15 din spate\"\nUser Gratiela liked post \"Ai incercat cu otel galvanizat?\"\nUser Aglaia liked repost \"Ai incercat cu otel galvanizat?\"\nUser Narcis liked post \"Ai incercat cu otel galvanizat?\"\nUser Ina liked post \"Ai incercat cu otel galvanizat?\"\nUser Felix liked repost \"Ai incercat cu otel galvanizat?\"\nUser Miruna liked post \"Ai incercat cu otel galvanizat?\"\nUser Iosif liked post \"Ai incercat cu otel galvanizat?\"\nUser Silvian liked repost \"Ai incercat cu otel galvanizat?\"\nUser Sinica liked post \"Ai incercat cu otel galvanizat?\"\nUser Fiodor liked post \"Ai incercat cu otel galvanizat?\"\nUser Cristofor liked repost \"Sper sa iau licenta anul asta\"\nUser Dimitrina liked repost \"Sper sa iau licenta anul asta\"\nUser Banel liked repost \"Sper sa iau licenta anul asta\"\nUser Dafina liked repost \"Sper sa iau licenta anul asta\"\nUser Didina liked repost \"Sper sa iau licenta anul asta\"\nUser Dominic liked repost \"Sper sa iau licenta anul asta\"\nUser Floarea liked repost \"Sper sa iau licenta anul asta\"\nUser Magdalena liked repost \"Sper sa iau licenta anul asta\"\nUser Izabela liked repost \"Sper sa iau licenta anul asta\"\nUser Elodia liked repost \"Sper sa iau licenta anul asta\"\nPost \"Pamantul este plat!\" has 2 likes\nPost \"STEAUA27\" has 1 likes\nPost \"Ai incercat cu otel galvanizat?\" has 8 likes\nPost \"Mai bine 5cm in fata decat 15 din spate\" has 4 likes\nThe original post is the highest rated\nPost 4 got ratio'd by repost 6\nThe original post is the highest rated\nCreated \"Segmentation fault(core dumped)\" for Vladimir\nCreated \"head so good she honor roll she riding me like carnival\" for Luana\nCreated \"CUMPAR TEMA LA MN, VA ROOOG dati mi mesaj in privat ASAP\" for Florin\nCreated \"You’re not like us\" for Anastasia\nCreated \"Tarnafes\" for Octaviana\nCreated repost #16 for Georgiana\nCreated repost #17 for Romanita\nCreated repost #18 for Alberta\nCreated repost #19 for Adelina\nCreated repost #20 for Geanina\nCreated repost #21 for Elena\nCreated repost #22 for Luca\nCreated repost #23 for Doina\nCreated repost #24 for Relu\nCreated repost #25 for Erica\nCreated repost #26 for Despina\nCreated repost #27 for Paula\nCreated repost #28 for Ileana\nCreated repost #29 for Teodora\nCreated repost #30 for Emanoil\nCreated repost #31 for Luana\nCreated repost #32 for Laurentiu\nCreated repost #33 for Georgian\nCreated repost #34 for Laurentiu\nCreated repost #35 for Ortansa\nThe first common repost of 31 and 27 is 9\nThe first common repost of 7 and 30 is 7\nThe first common repost of 27 and 9 is 9\nThe first common repost of 20 and 16 is 14\nThe first common repost of 30 and 28 is 28\nCreated \"Adrian Elicopter vs Selly. Who wins?\" for Florea\nCreated \"whats your eta?\" for Steluta\nCreated \"Cuvintele sunt de prisos\" for Agripina\nCreated \"Congratulations to the Astronauts that left Earth today. Good choice\" for Tudor\nCreated \"Eu sanatate multa am, si asta datorita ii, ca n-am baut si n-am fumat pana in clasa intai.\" for Mina\nCreated repost #41 for Ionut\nCreated repost #42 for Iurie\nCreated repost #43 for Marga\nCreated repost #44 for Flaviu\nCreated repost #45 for Ica\nUser Antonie liked post \"Segmentation fault(core dumped)\"\nUser Aurelian liked repost \"head so good she honor roll she riding me like carnival\"\nUser Oana liked post \"Segmentation fault(core dumped)\"\nUser Iurie liked repost \"Mai bine 5cm in fata decat 15 din spate\"\nUser Nelu liked repost \"whats your eta?\"\nUser Emilia liked post \"Eu sanatate multa am, si asta datorita ii, ca n-am baut si n-am fumat pana in clasa intai.\"\nUser George liked post \"Adrian Elicopter vs Selly. Who wins?\"\nUser Ludovic liked repost \"You’re not like us\"\nUser Sever liked post \"Congratulations to the Astronauts that left Earth today. Good choice\"\nUser Anamaria liked post \"Cuvintele sunt de prisos\"\nPost \"Segmentation fault(core dumped)\" has 2 likes\nPost \"Ai incercat cu otel galvanizat?\" has 8 likes\nPost \"Tarnafes\" has 0 likes\nCreated \"Citeste asta fara sa vada si ceilalti si prefa-te ca e amuzant si te distrezi copios\" for Raducu\nCreated \"stream girls night by loossemble\" for Georgiana\nCreated \"did you know that theres a tunnel under ocean boulevard\" for Anghelina\nCreated \"N ai restanta,n ai prestanta verik!\" for Adelaida\nCreated \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\" for Vasile\nCreated repost #51 for Laurentiu\nCreated repost #52 for Antoniu\nCreated repost #53 for Stancu\nCreated repost #54 for Ana\nCreated repost #55 for Sever\nCreated repost #56 for Veta\nCreated repost #57 for Zaharia\nCreated repost #58 for Beatrice\nCreated repost #59 for Gratian\nCreated repost #60 for Augustina\nDeleted repost #41 of post \"whats your eta?\"\nDeleted repost #33 of post \"Tarnafes\"\n\"Sper sa iau licenta anul asta\" - Post by Caius\nRepost #6 by Lica\nRepost #45 by Ica\n\"whats your eta?\" - Post by Steluta\n\"Cuvintele sunt de prisos\" - Post by Agripina\nRepost #44 by Flaviu\nRepost #54 by Ana\nRepost #60 by Augustina\n\"CUMPAR TEMA LA MN, VA ROOOG dati mi mesaj in privat ASAP\" - Post by Florin\nRepost #17 by Romanita\nRepost #32 by Laurentiu\nRepost #19 by Adelina\nRepost #58 by Beatrice\nRepost #51 by Laurentiu\n\"Tarnafes\" - Post by Octaviana\n",
        "time_normal": 0.0,
        "time_valgrind": 0.691854314,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 9,
        "name": "Posts Complex 2",
        "status": "3",
        "log": "Created \"Sper ca pot termina facultatea\" for Fiodor\nCreated \"Why does the Java developer wear glasses? He couldn’t C# :p\" for Basarab\nCreated \"Sper ca pot termina facultatea\" for Roxana\nCreated \"Away from 2 3 4 wonderful wonderful wonderful\" for Sidonia\nCreated \"Mergem inainte ca inainte era mai bine\" for Rodica\nCreated \"Exploding kittens\" for Livia\nCreated \"erm what the sigma\" for George\nCreated \"marriage is just preordering a milf\" for Fabian\nCreated \"whats your eta?\" for Marga\nCreated \"Stati ca Nokia inca face telefoane? Cu butoane? Sunt vreo 100-200 de lei. Am luat trei.\" for Teodosia\nCreated repost #11 for Constantin\nCreated repost #12 for Smaranda\nCreated repost #13 for Haralambie\nCreated repost #14 for Marcheta\nCreated repost #15 for Octavia\nCreated repost #16 for Benone\nCreated repost #17 for Tudor\nCreated repost #18 for Sanda\nCreated repost #19 for Marinela\nCreated repost #20 for Lucretiu\nUser Eftimie liked repost \"erm what the sigma\"\nUser Irinel liked post \"Exploding kittens\"\nUser Constantina liked post \"whats your eta?\"\nUser Flavia liked post \"Sper ca pot termina facultatea\"\nUser Laurian liked post \"Exploding kittens\"\nUser Antoniu liked post \"Stati ca Nokia inca face telefoane? Cu butoane? Sunt vreo 100-200 de lei. Am luat trei.\"\nUser Sandu liked repost \"whats your eta?\"\nUser Iustin liked post \"Why does the Java developer wear glasses? He couldn’t C# :p\"\nUser Alexandru liked post \"erm what the sigma\"\nUser Henrieta liked post \"Sper ca pot termina facultatea\"\nUser Horea liked post \"Mergem inainte ca inainte era mai bine\"\nUser Voichita liked post \"Why does the Java developer wear glasses? He couldn’t C# :p\"\nUser Patricia liked post \"Exploding kittens\"\nUser Beatrice liked post \"Exploding kittens\"\nUser Marta liked repost \"marriage is just preordering a milf\"\nUser Marcu liked post \"Sper ca pot termina facultatea\"\nUser Radu liked post \"whats your eta?\"\nUser Iacob liked post \"Sper ca pot termina facultatea\"\nUser Magdalena liked post \"marriage is just preordering a milf\"\nUser Ivona liked post \"Exploding kittens\"\nUser Ruxandra liked post \"Exploding kittens\"\nUser Bartolomeu liked post \"Sper ca pot termina facultatea\"\nUser Iosif liked post \"Why does the Java developer wear glasses? He couldn’t C# :p\"\nUser Dumitra liked post \"Sper ca pot termina facultatea\"\nUser Olimpia liked repost \"erm what the sigma\"\nUser Niculina liked post \"Mergem inainte ca inainte era mai bine\"\nUser Panagachie liked post \"Mergem inainte ca inainte era mai bine\"\nUser Stefania liked post \"whats your eta?\"\nUser Angel liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Alice liked repost \"erm what the sigma\"\nUser Cedrin liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Eufrosina liked post \"erm what the sigma\"\nUser Axenia liked post \"whats your eta?\"\nUser Paulina liked post \"Stati ca Nokia inca face telefoane? Cu butoane? Sunt vreo 100-200 de lei. Am luat trei.\"\nUser Haralambie liked post \"Why does the Java developer wear glasses? He couldn’t C# :p\"\nUser Iris liked repost \"Sper ca pot termina facultatea\"\nUser Antonie liked post \"Sper ca pot termina facultatea\"\nUser Banel liked repost \"Exploding kittens\"\nUser Betina liked post \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Renata liked post \"whats your eta?\"\nUser Mihnea liked post \"Sper ca pot termina facultatea\"\nUser Eliza liked post \"Sper ca pot termina facultatea\"\nUser Emil liked post \"Sper ca pot termina facultatea\"\nUser Lacramioara liked post \"Sper ca pot termina facultatea\"\nUser Razvan liked post \"Sper ca pot termina facultatea\"\nUser Anastasia liked post \"Sper ca pot termina facultatea\"\nUser Luiza liked post \"Sper ca pot termina facultatea\"\nUser Relu liked post \"Sper ca pot termina facultatea\"\nUser Gabriel liked post \"Sper ca pot termina facultatea\"\nUser Teohari liked post \"Sper ca pot termina facultatea\"\nUser Vicentia liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Eduard liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Visarion liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Draga liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Clarisa liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Ciprian liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Nicusor liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Renata liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Sava liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Liana liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Ruxandra liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Loredana liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Mioara liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Adam liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Constantina liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Saveta liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Emanuil liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Roxana liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Zoe liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Dorin liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Petronela liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Anamaria liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Constantina unliked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Viorela liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Marta liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Dida liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Flavia liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Julia liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Sebastian liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Stancu liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nRepost #12 has 1 likes\nPost \"Sper ca pot termina facultatea\" has 4 likes\nPost \"Why does the Java developer wear glasses? He couldn’t C# :p\" has 4 likes\nPost \"Sper ca pot termina facultatea\" has 13 likes\nPost \"Mergem inainte ca inainte era mai bine\" has 3 likes\nPost \"erm what the sigma\" has 2 likes\nPost \"marriage is just preordering a milf\" has 1 likes\nPost \"whats your eta?\" has 5 likes\nThe original post is the highest rated\nPost 4 got ratio'd by repost 19\nThe original post is the highest rated\nThe original post is the highest rated\nThe original post is the highest rated\nCreated \"Mergem inainte ca inainte era mai bine\" for Miron\nCreated \"Cine a fost primul? Gaina sau oul?\" for Ada\nCreated \"Am luat restanta la Ghiu, sigur si voi\" for Ieremia\nCreated \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\" for Tudor\nCreated \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\" for Pamfil\nCreated \"Cine sapa groapa altuia departe ajunge\" for Agripina\nCreated \"FCSB e Steaua Travis Scott la hamsii in Costinesti!\" for Marta\nCreated \"Cine a fost primul? Gaina sau oul?\" for Teea\nCreated \"you thought i was feelin u?\" for Nelu\nCreated \"SIUUUUUUUUUUUU\" for Arina\nCreated repost #31 for Bianca\nCreated repost #32 for Vasile\nCreated repost #33 for Letitia\nCreated repost #34 for Sanda\nCreated repost #35 for Dan\nCreated repost #36 for Georgel\nCreated repost #37 for Rafila\nCreated repost #38 for Tiberiu\nCreated repost #39 for Giorgiana\nCreated repost #40 for Tinca\nCreated repost #41 for Ludovica\nCreated repost #42 for Aristita\nCreated repost #43 for Alex\nCreated repost #44 for Mihail\nCreated repost #45 for Panait\nCreated repost #46 for Antonie\nCreated repost #47 for Barbu\nCreated repost #48 for Ivan\nCreated repost #49 for Antonela\nCreated repost #50 for Daria\nRepost #41 by Ludovica\n\"Why does the Java developer wear glasses? He couldn’t C# :p\" - Post by Basarab\nRepost #31 by Bianca\n\"Away from 2 3 4 wonderful wonderful wonderful\" - Post by Sidonia\nRepost #19 by Marinela\nRepost #33 by Letitia\nRepost #39 by Giorgiana\nRepost #47 by Barbu\n\"Mergem inainte ca inainte era mai bine\" - Post by Rodica\n\"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\" - Post by Pamfil\nRepost #38 by Tiberiu\n\"Cine a fost primul? Gaina sau oul?\" - Post by Teea\nRepost #42 by Aristita\nRepost #45 by Panait\nCreated \"La placinte la razboi, inainte inapoi\" for Ilinca\nCreated \"Congratulations to the Astronauts that left Earth today. Good choice\" for Ina\nCreated \"Cumpar tema 3 la SDA\" for Petrisor\nCreated \"erm what the sigma\" for Mariuca\nCreated \"Mor de foame, donati?\" for Leontin\nCreated \"Batman can’t even compare to Ryan Gosling\" for Ieremia\nCreated \"Cumpar tema 3 la SDA\" for Vlaicu\nCreated \"Ce faci? Bine...ascultam ploaia. Nu o auzi?\" for Cedrin\nCreated \"Sper ca pot termina facultatea\" for Iacob\nCreated \"Mor de foame, donati?\" for Despina\nCreated repost #61 for Lorelei\nCreated repost #62 for Minodora\nCreated repost #63 for Haralambie\nCreated repost #64 for Cezar\nCreated repost #65 for Emil\nCreated repost #66 for Tincuta\nCreated repost #67 for Tudorita\nCreated repost #68 for Angel\nCreated repost #69 for Vincentiu\nCreated repost #70 for Anghel\nCreated repost #71 for Georgel\nCreated repost #72 for Tiberiu\nCreated repost #73 for Aura\nCreated repost #74 for Dana\nCreated repost #75 for Veta\nCreated repost #76 for Mirabela\nCreated repost #77 for Ortansa\nCreated repost #78 for Sabin\nCreated repost #79 for Iurie\nCreated repost #80 for Carmen\nCreated repost #81 for Nicusor\nCreated repost #82 for Iris\nCreated repost #83 for Zaraza\nCreated repost #84 for Theodor\nCreated repost #85 for Martin\nCreated repost #86 for Aneta\nCreated repost #87 for Marcu\nCreated repost #88 for Alexandra\nCreated repost #89 for Ica\nCreated repost #90 for Anghel\nCreated repost #91 for Radu\nCreated repost #92 for Pavel\nCreated repost #93 for Fiona\nCreated repost #94 for Madalina\nCreated repost #95 for Nicu\nCreated repost #96 for Jean\nCreated repost #97 for Stancu\nCreated repost #98 for Florin\nCreated repost #99 for Evanghelina\nCreated repost #100 for Filofteia\nThe first common repost of 64 and 37 is 22\nThe first common repost of 40 and 36 is 30\nThe first common repost of 92 and 69 is 69\nThe first common repost of 32 and 66 is 24\nThe first common repost of 34 and 95 is 34\nThe first common repost of 38 and 78 is 25\nThe first common repost of 71 and 48 is 26\nThe first common repost of 73 and 85 is 58\nThe first common repost of 36 and 40 is 30\nThe first common repost of 73 and 85 is 58\nCreated \"Tarnafes\" for Eliza\nCreated \"Ati incercat sa ma bagati in orez? Poate asa imi revin\" for Eric\nCreated \"You’re not like us\" for Geta\nCreated \"Experienta de Content Warning in a nutshell: Ala e cumva Freddy Fazbear? Har har har ha- wtf is that...fugi Sebi, FUGI!!\" for Caius\nCreated \"Ati incercat sa ma bagati in orez? Poate asa imi revin\" for Amelia\nCreated \"erm what the sigma\" for Andrian\nCreated \"marriage is just preordering a milf\" for Petruta\nCreated \"Gigi Becali cumpara Dunarea Calarasi\" for Elisaveta\nCreated \"Batman can’t even compare to Ryan Gosling\" for Anamaria\nCreated \"Sper sa iau licenta anul asta\" for Eugen\nCreated repost #111 for Emilian\nCreated repost #112 for Amza\nCreated repost #113 for Rica\nCreated repost #114 for Olga\nCreated repost #115 for Mihail\nCreated repost #116 for Dida\nCreated repost #117 for Malina\nCreated repost #118 for Dafina\nCreated repost #119 for Daniel\nCreated repost #120 for Lazar\nUser Didina liked post \"you thought i was feelin u?\"\nUser Razvan liked post \"marriage is just preordering a milf\"\nUser Axenia liked post \"you thought i was feelin u?\"\nUser Mina liked post \"Ce faci? Bine...ascultam ploaia. Nu o auzi?\"\nUser Augustin liked repost \"Ce faci? Bine...ascultam ploaia. Nu o auzi?\"\nUser Vlad liked post \"erm what the sigma\"\nUser Mirabela liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Iosif liked post \"Mergem inainte ca inainte era mai bine\"\nUser Anatolie liked post \"La placinte la razboi, inainte inapoi\"\nUser Crenguta liked post \"Tarnafes\"\nUser Stancu liked repost \"Why does the Java developer wear glasses? He couldn’t C# :p\"\nUser Venera liked post \"Ati incercat sa ma bagati in orez? Poate asa imi revin\"\nUser Viorel liked repost \"FCSB e Steaua Travis Scott la hamsii in Costinesti!\"\nUser Luana liked post \"marriage is just preordering a milf\"\nUser Codruta liked post \"Mor de foame, donati?\"\nUser Alex liked repost \"Mergem inainte ca inainte era mai bine\"\nUser Gentiana liked post \"Gigi Becali cumpara Dunarea Calarasi\"\nUser Victoria liked repost \"erm what the sigma\"\nUser Mirabela liked repost \"Cine sapa groapa altuia departe ajunge\"\nUser Jean liked repost \"Sper ca pot termina facultatea\"\nUser Letitia liked repost \"Why does the Java developer wear glasses? He couldn’t C# :p\"\nUser Caius liked post \"Mor de foame, donati?\"\nUser Coralia liked repost \"Sper ca pot termina facultatea\"\nUser Ruxanda liked post \"Batman can’t even compare to Ryan Gosling\"\nUser Gratiela liked post \"you thought i was feelin u?\"\nUser Daciana liked post \"La placinte la razboi, inainte inapoi\"\nUser Maximilian liked post \"Cumpar tema 3 la SDA\"\nUser Ludovica liked post \"whats your eta?\"\nUser Paulina liked post \"Mergem inainte ca inainte era mai bine\"\nUser Liana liked post \"Experienta de Content Warning in a nutshell: Ala e cumva Freddy Fazbear? Har har har ha- wtf is that...fugi Sebi, FUGI!!\"\nUser Agnos liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Mircea liked post \"Experienta de Content Warning in a nutshell: Ala e cumva Freddy Fazbear? Har har har ha- wtf is that...fugi Sebi, FUGI!!\"\nUser Ovidiu liked repost \"erm what the sigma\"\nUser Daiana liked post \"Ati incercat sa ma bagati in orez? Poate asa imi revin\"\nUser Daria liked repost \"Away from 2 3 4 wonderful wonderful wonderful\"\nUser Miron liked repost \"Cine a fost primul? Gaina sau oul?\"\nUser Iurie liked post \"Mergem inainte ca inainte era mai bine\"\nUser Georgiana liked repost \"Mergem inainte ca inainte era mai bine\"\nUser Casandra liked post \"erm what the sigma\"\nUser Lucretia liked post \"erm what the sigma\"\nRepost #12 has 1 likes\nRepost #43 has 1 likes\nRepost #75 has 0 likes\nRepost #93 has 0 likes\nRepost #112 has 0 likes\nRepost #74 has 2 likes\nRepost #90 has 0 likes\nRepost #40 has 0 likes\nPost \"Cumpar tema 3 la SDA\" has 0 likes\nPost \"erm what the sigma\" has 2 likes\n",
        "time_normal": 0.0,
        "time_valgrind": 0.712070815,
        "timeout": 30000,
        "test_score": 3
      }
    ],
    [
      {
        "id": 0,
        "name": "Feed",
        "status": "0",
        "log": "Created \"marriage is just preordering a milf\" for Eva\nCreated \"Salutare utilizatori X, vreau sa impart cu voi aceasta melodie minunata  https://www.youtube.com/watch?v=0nyXRyVj4Vc \" for Jean\nCreated \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" for Cleopatra\nCreated \"Mor de foame, donati?\" for Cleopatra\nCreated \"Cumpar tema 3 la SDA\" for Eva\nCreated repost #6 for Cleopatra\nCreated repost #7 for Gratiela\nCreated repost #8 for Elisabeta\nCreated repost #9 for Natasa\nCreated repost #10 for Cleopatra\n",
        "time_normal": 0.0,
        "time_valgrind": 1.14310174,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 1,
        "name": "Feed Complex",
        "status": "0",
        "log": "Created \"Adrian Elicopter vs Selly. Who wins?\" for Sabin\nCreated \"Salutare utilizatori X, vreau sa impart cu voi aceasta melodie minunata  https://www.youtube.com/watch?v=0nyXRyVj4Vc \" for Stelian\nCreated \"Success jerks you off in private. Failure fucks you in public... that's life\" for Sabin\nCreated \"she=onika ate=burgers\" for Zaharia\nCreated \"Tara arde si baba zice ca sunt acri\" for Dragos\nCreated \"Experienta de Content Warning in a nutshell: Ala e cumva Freddy Fazbear? Har har har ha- wtf is that...fugi Sebi, FUGI!!\" for Gabi\nCreated \"down on the west coast they got a saying if youre not drinking then youre not playing\" for Ovidiu\nCreated \"Stati ca Nokia inca face telefoane? Cu butoane? Sunt vreo 100-200 de lei. Am luat trei.\" for Paulina\nCreated \"Cine sapa groapa altuia departe ajunge\" for Zaharia\nCreated \"Could I have the cheese gyuudon?\" for Ovidiu\nCreated repost #11 for Gheorghita\nCreated repost #12 for Sabin\nCreated repost #13 for Stelian\nCreated repost #14 for Paulina\nCreated repost #15 for Sabin\nCreated repost #16 for Casandra\nCreated repost #17 for Gabi\nCreated repost #18 for Casandra\nCreated repost #19 for Ovidiu\nCreated repost #20 for Dragos\n",
        "time_normal": 0.0,
        "time_valgrind": 1.075709002,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 2,
        "name": "Profile",
        "status": "0",
        "log": "Created \"stream girls night by loossemble\" for Vlad\nCreated \"Cine a pus wc-ul in baie a fost un geniu\" for Vlad\nCreated \"Ai incercat cu otel galvanizat?\" for Antonela\nCreated \"Eu sanatate multa am, si asta datorita ii, ca n-am baut si n-am fumat pana in clasa intai.\" for Antonela\nCreated \"fantastic!\" for Antonela\nCreated repost #6 for Constanta\nCreated repost #7 for Eva\nCreated repost #8 for Madalina\nCreated repost #9 for Vlad\nCreated repost #10 for Constanta\n",
        "time_normal": 0.0,
        "time_valgrind": 1.100602465,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 3,
        "name": "Profile Complex",
        "status": "0",
        "log": "Created \"La placinte la razboi, inainte inapoi\" for Carolina\nCreated \"fantastic!\" for Gregorian\nCreated \"she=onika ate=burgers\" for Carolina\nCreated \"Congratulations to the Astronauts that left Earth today. Good choice\" for Carolina\nCreated \"Pamantul este plat!\" for Dorian\nCreated \"Success jerks you off in private. Failure fucks you in public... that's life\" for Emanoil\nCreated \"O luam de la cap din nou Stii ca sunt dilau-lau-lau Am la mine banii pe show Vagabontii-n dreapta, go go go O sa fie lata Suntem in brigada Atmosfera e ciudata Cand bei apa plata\" for Miruna\nCreated \"Segmentation fault(core dumped)\" for Dorian\nCreated \"*touches circumcision scar* who did this to you\" for Emanoil\nCreated \"down on the west coast they got a saying if youre not drinking then youre not playing\" for Ivona\nCreated repost #11 for Emanoil\nCreated repost #12 for Emanoil\nCreated repost #13 for Miruna\nCreated repost #14 for Ivona\nCreated repost #15 for Ivona\nCreated repost #16 for Leopoldina\nCreated repost #17 for Gregorian\nCreated repost #18 for Dorian\nCreated repost #19 for Constantin\nCreated repost #20 for Ivona\n",
        "time_normal": 0.0,
        "time_valgrind": 1.100570896,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 4,
        "name": "Reposts",
        "status": "0",
        "log": "Created \"fantastic!\" for Sanda\nCreated repost #2 for Victor\nCreated repost #3 for Sanda\nCreated repost #4 for Rada\nCreated repost #5 for Cazimir\nCreated repost #6 for Crenguta\n",
        "time_normal": 0.0,
        "time_valgrind": 1.070884394,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 5,
        "name": "Reposts Complex",
        "status": "0",
        "log": "Created \"Going to Apollo who s down?\" for Ozana\nCreated \"fantastic!\" for Ozana\nCreated repost #3 for Paul\nCreated repost #4 for Rafael\nCreated repost #5 for Ozana\nCreated repost #6 for Tiberiu\nCreated repost #7 for Zina\nCreated repost #8 for Xenia\nCreated repost #9 for Emanuela\nCreated repost #10 for Paul\nCreated repost #11 for Alberta\nCreated repost #12 for Maxim\n",
        "time_normal": 0.0,
        "time_valgrind": 1.08511405,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 6,
        "name": "Clique",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 0.629824177,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 7,
        "name": "Clique Complex",
        "status": "0",
        "log": "",
        "time_normal": 0.0,
        "time_valgrind": 0.703695936,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 8,
        "name": "Feed Complex 1",
        "status": "0",
        "log": "Created \"Congratulations to the Astronauts that left Earth today. Good choice\" for Amza\nCreated \"Luke, I am your father\" for Basarab\nCreated \"I'm built different. Incorrectly.\" for Constantin\nCreated \"Adrian Elicopter vs Selly. Who wins?\" for Basarab\nCreated \"Roses are red, violets are blue, I think I deleted System32\" for Basarab\nCreated repost #6 for Basarab\nCreated repost #7 for Gabriel\nCreated repost #8 for Constantin\nCreated repost #9 for Constantin\nCreated repost #10 for Basarab\nCreated \"Experienta de Content Warning in a nutshell: Ala e cumva Freddy Fazbear? Har har har ha- wtf is that...fugi Sebi, FUGI!!\" for Dinu\nCreated repost #12 for Gabriel\nCreated repost #13 for Constanta\nCreated repost #14 for Denisa\nCreated repost #15 for Aurel\nCreated repost #16 for Denisa\nCreated \"Experienta de Content Warning in a nutshell: Ala e cumva Freddy Fazbear? Har har har ha- wtf is that...fugi Sebi, FUGI!!\" for Henrieta\nCreated \"Sper ca pot termina facultatea\" for Saveta\nCreated \"Ai incercat cu otel galvanizat?\" for Giorgiana\nCreated \"https://www.youtube.com/watch?v=wtQGvuuzst0\" for Artemisa\nCreated \"Ce faci? Bine...ascultam ploaia. Nu o auzi?\" for Veta\nCreated repost #22 for Didina\nCreated repost #23 for Cedrin\nCreated repost #24 for Teohari\nCreated repost #25 for Mioara\nCreated repost #26 for Betina\nCreated repost #27 for Petre\nCreated repost #28 for Maria\nCreated repost #29 for Raducu\nCreated repost #30 for Mihnea\nCreated repost #31 for Luca\nCreated repost #32 for Radu\nCreated repost #33 for Bartolomeu\nCreated repost #34 for Ozana\nCreated repost #35 for Voicu\nCreated repost #36 for Antoaneta\nCreated repost #37 for Adonis\nCreated repost #38 for Oliviu\nCreated repost #39 for Aura\nCreated repost #40 for Costache\nCreated repost #41 for Malina\nThe first common repost of 27 and 24 is 18\nThe first common repost of 13 and 7 is 3\nThe first common repost of 35 and 26 is 26\nThe first common repost of 8 and 7 is 3\nThe first common repost of 22 and 33 is 22\nCreated \"Cine a pus wc-ul in baie a fost un geniu\" for Adam\nCreated \"Batman can’t even compare to Ryan Gosling\" for Crin\nCreated \"I was born at a very young age\" for Bernard\nCreated \"You’re not like us\" for Matei\nCreated \"https://www.youtube.com/watch?v=wtQGvuuzst0\" for Luana\nCreated repost #47 for Darius\nCreated repost #48 for Olimpiu\nCreated repost #49 for Elodia\nCreated repost #50 for Venera\nCreated repost #51 for Albertina\nCreated repost #52 for Vicentiu\nCreated repost #53 for Tania\nCreated repost #54 for Ilarie\nCreated repost #55 for Titus\nCreated repost #56 for Roxana\n\"Cine a pus wc-ul in baie a fost un geniu\" - Post by Adam\n\"I'm built different. Incorrectly.\" - Post by Constantin\nRepost #7 by Gabriel\nRepost #8 by Constantin\nRepost #13 by Constanta\nRepost #56 by Roxana\n\"I was born at a very young age\" - Post by Bernard\nRepost #51 by Albertina\n\"Roses are red, violets are blue, I think I deleted System32\" - Post by Basarab\nRepost #10 by Basarab\nRepost #34 by Ozana\nCreated \"SIUUUUUUUUUUUU\" for Laurentiu\nCreated \"@realDonaldTrump Did you really start mewing to skibidi ohio? Are you a sigma or did you get fandum taxxed\" for Petrut\nCreated \"vreau sa merg la mare si sa stau la soare, dar n-am cu cine si n-am cu ceee, ma am doar pe mine, ia priviti mai bine, hai ca nu-s de coalea breee\" for Gheorghe\nCreated \"Prietenul la nevoie iti ia toata mana\" for Mircea\nCreated \"Cine sapa groapa altuia departe ajunge\" for Georgian\nCreated repost #62 for Dariana\nCreated repost #63 for Vincentiu\nCreated repost #64 for Caterina\nCreated repost #65 for Marga\nCreated repost #66 for Basarab\nUser Ionela liked post \"I was born at a very young age\"\nUser Adelaida liked post \"SIUUUUUUUUUUUU\"\nUser Martin liked post \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Arsenie liked post \"I'm built different. Incorrectly.\"\nUser Claudia liked repost \"I was born at a very young age\"\nUser Iosefina liked post \"@realDonaldTrump Did you really start mewing to skibidi ohio? Are you a sigma or did you get fandum taxxed\"\nUser Stancu liked repost \"Luke, I am your father\"\nUser Marcu liked post \"Prietenul la nevoie iti ia toata mana\"\nUser Irina liked post \"Luke, I am your father\"\nUser Dumitrana liked post \"Sper ca pot termina facultatea\"\nPost \"I'm built different. Incorrectly.\" has 1 likes\nPost \"Adrian Elicopter vs Selly. Who wins?\" has 0 likes\nPost \"https://www.youtube.com/watch?v=wtQGvuuzst0\" has 1 likes\nCreated \"Ai incercat cu otel galvanizat?\" for Amza\nCreated \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" for Albert\nCreated \"In o lume plina de mizerie, fii tu mop!\" for Simona\nCreated \"Sper sa iau licenta anul asta\" for Maria\nCreated \"Cuvintele sunt de prisos\" for Anghel\nCreated repost #72 for Elisabeta\nCreated repost #73 for Emanoil\nCreated repost #74 for Andrada\nCreated repost #75 for Dumitru\nCreated repost #76 for Martin\nUser Emanuil liked post \"Roses are red, violets are blue, I think I deleted System32\"\nUser Florenta liked repost \"Luke, I am your father\"\nUser Octaviana liked repost \"https://www.youtube.com/watch?v=wtQGvuuzst0\"\nUser Martin liked repost \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Gicu liked post \"Experienta de Content Warning in a nutshell: Ala e cumva Freddy Fazbear? Har har har ha- wtf is that...fugi Sebi, FUGI!!\"\nUser Plesu liked post \"Prietenul la nevoie iti ia toata mana\"\nUser Bogdana liked post \"I'm built different. Incorrectly.\"\nUser Marcel liked post \"Cine sapa groapa altuia departe ajunge\"\nUser Antonela liked post \"Prietenul la nevoie iti ia toata mana\"\nUser Alis liked post \"I'm built different. Incorrectly.\"\nUser Plesu liked post \"I'm built different. Incorrectly.\"\nUser Flavia liked post \"I'm built different. Incorrectly.\"\nUser Iancu liked post \"I'm built different. Incorrectly.\"\nUser Vlad liked repost \"I'm built different. Incorrectly.\"\nUser Panagachie liked post \"I'm built different. Incorrectly.\"\nUser Alis unliked post \"I'm built different. Incorrectly.\"\nUser Daria liked post \"I'm built different. Incorrectly.\"\nUser Teohari liked post \"I'm built different. Incorrectly.\"\nUser Malina liked post \"I'm built different. Incorrectly.\"\nUser Marta liked post \"I'm built different. Incorrectly.\"\nUser Vasilica liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Angel liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Stefania liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Salomea liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Anabela liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Milena liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Florin liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Rafila liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Rodica liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Lacramioara liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nPost \"Experienta de Content Warning in a nutshell: Ala e cumva Freddy Fazbear? Har har har ha- wtf is that...fugi Sebi, FUGI!!\" has 0 likes\nPost \"Cine a pus wc-ul in baie a fost un geniu\" has 0 likes\nPost \"Ai incercat cu otel galvanizat?\" has 0 likes\nPost \"You’re not like us\" has 0 likes\nThe original post is the highest rated\nPost 4 got ratio'd by repost 9\nThe original post is the highest rated\nCreated \"Prietenul la nevoie iti ia toata mana\" for Dorin\nCreated \"La placinte la razboi, inainte inapoi\" for Minodora\nCreated \"FCSB e Steaua Travis Scott la hamsii in Costinesti!\" for Ozana\nCreated \"Cine a pus wc-ul in baie a fost un geniu\" for Filip\nCreated \"I was born at a very young age\" for Haralamb\nCreated repost #82 for Stelian\nCreated repost #83 for Haralamb\nCreated repost #84 for Liana\nCreated repost #85 for Estera\nCreated repost #86 for Giorgiana\n",
        "time_normal": 0.0,
        "time_valgrind": 0.729788723,
        "timeout": 30000,
        "test_score": 3
      },
      {
        "id": 9,
        "name": "Feed Complex 2",
        "status": "0",
        "log": "Created \"marriage is just preordering a milf\" for Edgar\nCreated \"FCSB e Steaua Travis Scott la hamsii in Costinesti!\" for Zeno\nCreated \"Success jerks you off in private. Failure fucks you in public... that's life\" for Stancu\nCreated \"whats your eta?\" for Irinel\nCreated \"marriage is just preordering a milf\" for Lucia\nCreated \"stan loona\" for Crina\nCreated \"Adrian Elicopter vs Selly. Who wins?\" for Irinel\nCreated \"Prietenul la nevoie iti ia toata mana\" for Andrian\nCreated \"Cine a pus wc-ul in baie a fost un geniu\" for Edgar\nCreated \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" for Eliza\nCreated repost #11 for Lucia\nCreated repost #12 for Cosmina\nCreated repost #13 for Erica\nCreated repost #14 for Dochia\nCreated repost #15 for Lucretiu\nCreated repost #16 for Lucretiu\nCreated repost #17 for Virginia\nCreated repost #18 for Lidia\nCreated repost #19 for Eliana\nCreated repost #20 for Marius\nCreated \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\" for Aurelian\nCreated \"Despite the constant negative press covfefe\" for Draga\nCreated \"did you know that theres a tunnel under ocean boulevard\" for Simona\nCreated \"Nu merge checker ul la IOCLA :(\" for Irinel\nCreated \"stream girls night by loossemble\" for Rica\nCreated \"Salutare fratilor, va rog sa ascultati aceasta parodie muzicala, pe care am compus-o pentru fanii mei, astept pareri https://www.youtube.com/watch?v=f1G2tbNpyHg #smallYoutuber\" for Silvian\nCreated \"The horros persist but so do I\" for Alis\nCreated \"Mergem inainte ca inainte era mai bine\" for Tudosia\nCreated \"Doing laundry today, it sucks!!\" for Dumitra\nCreated \"STEAUA27\" for Ilona\nCreated repost #31 for Zoe\nCreated repost #32 for Filip\nCreated repost #33 for Xenia\nCreated repost #34 for Clarisa\nCreated repost #35 for Oana\nCreated repost #36 for Ieremia\nCreated repost #37 for Georgel\nCreated repost #38 for Rafila\nCreated repost #39 for Ruxanda\nCreated repost #40 for Codrut\nUser Emilia liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Maricica liked post \"stan loona\"\nUser Mariuca liked post \"stream girls night by loossemble\"\nUser Constantina liked post \"Prietenul la nevoie iti ia toata mana\"\nUser Vlaicu liked post \"whats your eta?\"\nUser Andreea liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Draga liked repost \"stan loona\"\nUser Nichifor liked post \"stan loona\"\nUser Nicu liked post \"Prietenul la nevoie iti ia toata mana\"\nUser Ionela liked repost \"marriage is just preordering a milf\"\nUser Catalina liked post \"Doing laundry today, it sucks!!\"\nUser Andrei liked post \"Nu merge checker ul la IOCLA :(\"\nUser Petronela liked post \"This month I am doing a challenge called May. It's where I try to make it through every day of May\"\nUser Frusina liked post \"whats your eta?\"\nUser Edgar liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Aurel liked post \"Salutare fratilor, va rog sa ascultati aceasta parodie muzicala, pe care am compus-o pentru fanii mei, astept pareri https://www.youtube.com/watch?v=f1G2tbNpyHg #smallYoutuber\"\nUser Cristobal liked post \"did you know that theres a tunnel under ocean boulevard\"\nUser Octavian liked post \"whats your eta?\"\nUser Madalina liked post \"stream girls night by loossemble\"\nUser Viorela liked post \"Despite the constant negative press covfefe\"\nUser Emilia liked post \"stan loona\"\nUser Antonia liked post \"Mergem inainte ca inainte era mai bine\"\nUser Petruta liked post \"stan loona\"\nUser Zamfir liked post \"Adrian Elicopter vs Selly. Who wins?\"\nUser Angela liked post \"marriage is just preordering a milf\"\nUser Olimpia liked post \"Salutare fratilor, va rog sa ascultati aceasta parodie muzicala, pe care am compus-o pentru fanii mei, astept pareri https://www.youtube.com/watch?v=f1G2tbNpyHg #smallYoutuber\"\nUser Olimpia liked post \"STEAUA27\"\nUser Cezar liked post \"Salutare fratilor, va rog sa ascultati aceasta parodie muzicala, pe care am compus-o pentru fanii mei, astept pareri https://www.youtube.com/watch?v=f1G2tbNpyHg #smallYoutuber\"\nUser Vlad liked repost \"This month I am doing a challenge called May. It's where I try to make it through every day of May\"\nUser Salomea liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Estera liked post \"FCSB e Steaua Travis Scott la hamsii in Costinesti!\"\nUser Sidonia liked post \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Francesca liked post \"FCSB e Steaua Travis Scott la hamsii in Costinesti!\"\nUser Natasa liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Stefania liked post \"STEAUA27\"\nUser Aleodor liked post \"marriage is just preordering a milf\"\nUser Darius liked post \"The horros persist but so do I\"\nUser Celia liked post \"marriage is just preordering a milf\"\nUser Teohari liked repost \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Elvira liked post \"stream girls night by loossemble\"\nUser Mihnea liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Evanghelina liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Banel liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Daniel liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Ariana liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Zoe liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Catalina liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Marilena liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Lascar liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Eusebiu liked post \"Success jerks you off in private. Failure fucks you in public... that's life\"\nUser Tincuta liked post \"whats your eta?\"\nUser Lorin liked post \"whats your eta?\"\nUser Tudorita liked post \"whats your eta?\"\nUser Miron liked post \"whats your eta?\"\nUser Gicu liked post \"whats your eta?\"\nUser Aura liked post \"whats your eta?\"\nUser Jeana liked post \"whats your eta?\"\nUser Rodica liked post \"whats your eta?\"\nUser Marcu liked post \"whats your eta?\"\nUser Emil liked post \"whats your eta?\"\nUser Fiona liked post \"whats your eta?\"\nUser Ducu liked post \"whats your eta?\"\nUser Antoaneta liked post \"whats your eta?\"\nUser Florin liked post \"whats your eta?\"\nUser Aneta liked post \"whats your eta?\"\nUser Stancu liked post \"whats your eta?\"\nUser Leonard liked post \"whats your eta?\"\nUser Carla liked post \"whats your eta?\"\nUser Tiberiu liked post \"whats your eta?\"\nUser Eustatiu liked post \"whats your eta?\"\nUser Margareta liked post \"whats your eta?\"\nUser Silvana liked post \"whats your eta?\"\nUser Barbu liked post \"whats your eta?\"\nUser Visarion liked post \"whats your eta?\"\nUser Mihai liked post \"whats your eta?\"\nUser Voicu liked post \"whats your eta?\"\nUser Theodor liked post \"whats your eta?\"\nUser Irinel liked post \"whats your eta?\"\nUser Cristea liked post \"whats your eta?\"\nUser Anastasia liked post \"whats your eta?\"\nRepost #12 has 0 likes\nRepost #39 has 0 likes\nRepost #13 has 0 likes\nRepost #20 has 1 likes\nRepost #34 has 0 likes\nRepost #38 has 1 likes\nPost \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" has 1 likes\nPost \"Salutare fratilor, va rog sa ascultati aceasta parodie muzicala, pe care am compus-o pentru fanii mei, astept pareri https://www.youtube.com/watch?v=f1G2tbNpyHg #smallYoutuber\" has 3 likes\nPost \"Success jerks you off in private. Failure fucks you in public... that's life\" has 13 likes\nPost \"Adrian Elicopter vs Selly. Who wins?\" has 1 likes\nThe original post is the highest rated\nThe original post is the highest rated\nThe original post is the highest rated\nThe original post is the highest rated\nThe original post is the highest rated\nCreated \"Batman can’t even compare to Ryan Gosling\" for Anastasia\nCreated \"FCSB e Steaua Travis Scott la hamsii in Costinesti!\" for Anastasia\nCreated repost #43 for Timea\nCreated repost #44 for Flaviu\nCreated repost #45 for Lazar\nCreated repost #46 for Horatiu\nCreated repost #47 for Liviu\nCreated repost #48 for Frederic\nCreated repost #49 for Atena\nCreated repost #50 for Teohari\nCreated repost #51 for Panait\nCreated repost #52 for Georgiana\nCreated \"Sometimes the silliest things happen and silly little tears begin to fall from my silly little eyes\" for Elvira\nCreated \"Cuvintele sunt de prisos\" for Romeo\nCreated \"Gigi Becali cumpara Dunarea Calarasi\" for Inocentiu\nCreated \"Nu merge checker ul la IOCLA :(\" for Aura\nCreated \"Going to Apollo who s down?\" for Florenta\nCreated \"she=onika ate=burgers\" for Sorin\nCreated \"Luke, I am your father\" for Caius\nCreated \"Away from 2 3 4 wonderful wonderful wonderful\" for Dorina\nCreated \"Salutare fratilor, va rog sa ascultati aceasta parodie muzicala, pe care am compus-o pentru fanii mei, astept pareri https://www.youtube.com/watch?v=f1G2tbNpyHg #smallYoutuber\" for Gentiana\nCreated \"Cine a pus wc-ul in baie a fost un geniu\" for Codrut\nCreated repost #63 for Silvian\nCreated repost #64 for Mariuca\nCreated repost #65 for Eustatiu\nCreated repost #66 for Aneta\nCreated repost #67 for Rozalia\nCreated repost #68 for Aura\nCreated repost #69 for Carina\nCreated repost #70 for Florina\nCreated repost #71 for Marilena\nCreated repost #72 for Dan\nCreated repost #73 for Aurora\nCreated repost #74 for Valeriu\nCreated repost #75 for Lidia\nCreated repost #76 for Catinca\nCreated repost #77 for Dorina\nCreated repost #78 for Mihaela\nCreated repost #79 for Atena\nCreated repost #80 for Haralamb\nCreated repost #81 for Octav\nCreated repost #82 for Zoe\nCreated repost #83 for Antonia\nCreated repost #84 for Nelu\nCreated repost #85 for Darius\nCreated repost #86 for Amza\nCreated repost #87 for Banel\nCreated repost #88 for Clementina\nCreated repost #89 for Brandusa\nCreated repost #90 for Catalin\nCreated repost #91 for Minodora\nCreated repost #92 for Tinca\nCreated repost #93 for Fiona\nCreated repost #94 for Maximilian\nCreated repost #95 for Florea\nCreated repost #96 for Petrut\nCreated repost #97 for Basarab\nCreated repost #98 for Dariana\nCreated repost #99 for Lorelei\nCreated repost #100 for Alice\nCreated repost #101 for Voicu\nCreated repost #102 for Otilia\nThe first common repost of 20 and 13 is 10\nThe first common repost of 18 and 67 is 1\nThe first common repost of 11 and 69 is 9\nThe first common repost of 101 and 98 is 98\nThe first common repost of 75 and 51 is 8\nThe first common repost of 35 and 52 is 25\nThe first common repost of 16 and 92 is 16\nThe first common repost of 15 and 11 is 9\nThe first common repost of 13 and 20 is 10\nThe first common repost of 65 and 34 is 28\nCreated \"erm what the sigma\" for Adrian\nCreated \"Eu sanatate multa am, si asta datorita ii, ca n-am baut si n-am fumat pana in clasa intai.\" for Timea\nCreated \"Segmentation fault(core dumped)\" for Felicia\nCreated \"I was born at a very young age\" for Otilia\nCreated \"Cine a pus wc-ul in baie a fost un geniu\" for Carmen\nCreated \"did you know that theres a tunnel under ocean boulevard\" for George\nCreated \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" for Mariuca\nCreated \"Salutare utilizatori X, vreau sa impart cu voi aceasta melodie minunata  https://www.youtube.com/watch?v=0nyXRyVj4Vc \" for Liviu\nCreated \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\" for Ionela\nCreated \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\" for Aurel\nCreated repost #113 for Floarea\nCreated repost #114 for Carol\nCreated repost #115 for Loredana\nCreated repost #116 for Jean\nCreated repost #117 for Carla\nCreated repost #118 for Alin\nCreated repost #119 for Iurie\nCreated repost #120 for Catrinel\nCreated repost #121 for Florin\nCreated repost #122 for Antonie\nCreated \"Pamantul este plat!\" for Sava\nCreated \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" for Barbu\nCreated \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" for Irina\nCreated \"Prietenul la nevoie iti ia toata mana\" for Natalia\nCreated \"Mergem inainte ca inainte era mai bine\" for Horea\nCreated \"This month I am doing a challenge called May. It's where I try to make it through every day of May\" for Livia\nCreated \"La placinte la razboi, inainte inapoi\" for Flavia\nCreated \"Luke, eu am plecat dupa lapte acum 20 de ani\" for Amza\nCreated \"you thought i was feelin u?\" for Blanduzia\nCreated \"stan loona\" for Edgar\nCreated repost #133 for Laurentiu\nCreated repost #134 for Jan\nCreated repost #135 for Clarisa\nCreated repost #136 for Luiza\nCreated repost #137 for Elvira\nCreated repost #138 for Augustina\nCreated repost #139 for Nicolae\nCreated repost #140 for Casandra\nCreated repost #141 for Florin\nCreated repost #142 for Ilie\nCreated repost #143 for Dalia\nCreated repost #144 for Cosmina\nCreated repost #145 for Catinca\nCreated repost #146 for Mihaela\nCreated repost #147 for Estera\nCreated repost #148 for Niculina\nCreated repost #149 for Emanuela\nCreated repost #150 for Eusebiu\nCreated repost #151 for Ioan\nCreated repost #152 for Gratian\nRepost #119 by Iurie\n\"FCSB e Steaua Travis Scott la hamsii in Costinesti!\" - Post by Zeno\nRepost #66 by Aneta\nRepost #102 by Otilia\nRepost #68 by Aura\nRepost #151 by Ioan\n\"stan loona\" - Post by Edgar\nRepost #143 by Dalia\n\"Batman can’t even compare to Ryan Gosling\" - Post by Anastasia\nRepost #81 by Octav\n\"Cine a pus wc-ul in baie a fost un geniu\" - Post by Edgar\nRepost #11 by Lucia\nRepost #15 by Lucretiu\nRepost #118 by Alin\nRepost #69 by Carina\nRepost #133 by Laurentiu\n\"Despite the constant negative press covfefe\" - Post by Draga\nRepost #32 by Filip\nRepost #149 by Emanuela\nRepost #152 by Gratian\n\"Nu merge checker ul la IOCLA :(\" - Post by Aura\nRepost #73 by Aurora\nRepost #77 by Dorina\nRepost #86 by Amza\nRepost #148 by Niculina\n\"stream girls night by loossemble\" - Post by Rica\nRepost #35 by Oana\nRepost #52 by Georgiana\n\"This month I am doing a challenge called May. It's where I try to make it through every day of May\" - Post by Barbu\n\"Prietenul la nevoie iti ia toata mana\" - Post by Natalia\nCreated \"you thought i was feelin u?\" for Stelian\nCreated \"Exploding kittens\" for Carolina\nCreated \"SIUUUUUUUUUUUU\" for Niculina\nCreated \"CUMPAR TEMA LA MN, VA ROOOG dati mi mesaj in privat ASAP\" for Lucretiu\nCreated \"Salutare utilizatori X, vreau sa impart cu voi aceasta melodie minunata  https://www.youtube.com/watch?v=0nyXRyVj4Vc \" for Alex\nCreated \"La placinte la razboi, inainte inapoi\" for Antoniu\nCreated \"Going to Apollo who s down?\" for Codruta\nCreated \"N ai restanta,n ai prestanta verik!\" for Nicuta\nCreated \"Could I have the cheese gyuudon?\" for Dorin\nCreated \"vand tema 3 la sda; nu bate, nu troncane, a condus-o o batranica pana la aprozar\" for Stan\nCreated repost #163 for Emanoil\nCreated repost #164 for Eftimie\nCreated repost #165 for Lazar\nCreated repost #166 for Bogdana\nCreated repost #167 for Andreea\nCreated repost #168 for Beniamin\nCreated repost #169 for Iosefina\nCreated repost #170 for Romulus\nCreated repost #171 for Vladimir\nCreated repost #172 for Daniel\nUser Angel liked repost \"Nu merge checker ul la IOCLA :(\"\nUser Leana liked post \"Salutare utilizatori X, vreau sa impart cu voi aceasta melodie minunata  https://www.youtube.com/watch?v=0nyXRyVj4Vc \"\nUser Narcis liked repost \"Adrian Elicopter vs Selly. Who wins?\"\nUser Leopoldina liked post \"SIUUUUUUUUUUUU\"\nUser Frusina liked repost \"This bard, sir kendrick of lamar you speak of... he hath slain how many drakes, you say? with but the power of song?\"\nUser Zeno liked post \"Batman can’t even compare to Ryan Gosling\"\nUser Crina liked post \"you thought i was feelin u?\"\nUser Ilie liked repost \"you thought i was feelin u?\"\nUser Olga liked post \"Doing laundry today, it sucks!!\"\nUser Izabela liked post \"This month I am doing a challenge called May. It's where I try to make it through every day of May\"\nUser Coralia liked repost \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Laurentiu liked post \"Gigi Becali cumpara Dunarea Calarasi\"\nUser Miron liked post \"stream girls night by loossemble\"\nUser Henrieta liked post \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Mugur liked post \"Cuvintele sunt de prisos\"\nUser Stelian liked post \"STEAUA27\"\nUser Nicuta liked post \"Prietenul la nevoie iti ia toata mana\"\nUser Ileana liked post \"Despite the constant negative press covfefe\"\nUser Panait liked post \"Adrian Elicopter vs Selly. Who wins?\"\nUser Madalina liked post \"This month I am doing a challenge called May. It's where I try to make it through every day of May\"\nUser Romulus liked post \"Cine a pus wc-ul in baie a fost un geniu\"\nUser Teodora liked post \"La placinte la razboi, inainte inapoi\"\nUser Ghita liked post \"Gigi Becali cumpara Dunarea Calarasi\"\nUser Iuliana liked post \"vand tema 3 la sda; nu bate, nu troncane, a condus-o o batranica pana la aprozar\"\nUser Nidia liked post \"Salutare utilizatori X, vreau sa impart cu voi aceasta melodie minunata  https://www.youtube.com/watch?v=0nyXRyVj4Vc \"\nUser Vasilica liked post \"Salutare fratilor, va rog sa ascultati aceasta parodie muzicala, pe care am compus-o pentru fanii mei, astept pareri https://www.youtube.com/watch?v=f1G2tbNpyHg #smallYoutuber\"\nUser Emilian liked post \"STEAUA27\"\nUser Zoe liked post \"Going to Apollo who s down?\"\nUser Damian liked post \"CUMPAR TEMA LA MN, VA ROOOG dati mi mesaj in privat ASAP\"\nUser Iosefina liked post \"CUMPAR TEMA LA MN, VA ROOOG dati mi mesaj in privat ASAP\"\nUser Adela liked repost \"Pamantul este plat!\"\nUser Fiona liked post \"CUMPAR TEMA LA MN, VA ROOOG dati mi mesaj in privat ASAP\"\nUser Banel liked post \"Pamantul este plat!\"\nUser Ada liked post \"STEAUA27\"\nUser Beniamin liked post \"This month I am doing a challenge called May. It's where I try to make it through every day of May\"\nUser Ariana liked post \"Prietenul la nevoie iti ia toata mana\"\nUser Ada liked post \"erm what the sigma\"\nUser Ionut liked repost \"Going to Apollo who s down?\"\nUser Clementina liked post \"Sigma hack #28 If your tummy starts hurting while you're on a date... Call your mom. She can pick you up. No need to cry.\"\nUser Maricica liked post \"Segmentation fault(core dumped)\"\nRepost #140 has 0 likes\nRepost #94 has 0 likes\nRepost #100 has 0 likes\nRepost #116 has 0 likes\nRepost #145 has 0 likes\nRepost #147 has 0 likes\nPost \"Cuvintele sunt de prisos\" has 1 likes\nPost \"Going to Apollo who s down?\" has 1 likes\nPost \"Salutare fratilor, va rog sa ascultati aceasta parodie muzicala, pe care am compus-o pentru fanii mei, astept pareri https://www.youtube.com/watch?v=f1G2tbNpyHg #smallYoutuber\" has 1 likes\nPost \"Salutare utilizatori X, vreau sa impart cu voi aceasta melodie minunata  https://www.youtube.com/watch?v=0nyXRyVj4Vc \" has 1 likes\nDeleted repost #35 of post \"stream girls night by loossemble\"\n\"stream girls night by loossemble\" - Post by Rica\nRepost #52 by Georgiana\nRepost #12 by Cosmina\nRepost #96 by Petrut\nDeleted repost #66 of post \"FCSB e Steaua Travis Scott la hamsii in Costinesti!\"\n\"FCSB e Steaua Travis Scott la hamsii in Costinesti!\" - Post by Zeno\nRepost #68 by Aura\nRepost #151 by Ioan\nRepost #16 by Lucretiu\nRepost #83 by Antonia\nRepost #92 by Tinca\nRepost #69 by Carina\n",
        "time_normal": 0.0,
        "time_valgrind": 1.246983019,
        "timeout": 30000,
        "test_score": 3
      }
    ]
  ],
  "test_path": "checker/",
  "exec_name": [
    "friends",
    "posts",
    "feed"
  ],
  "valgrind_enabled": true
}